In [3]:
import pandas as pd
import sqlite3

df = pd.read_csv('/kaggle/input/day-13-online-courses/day_13_online_courses.csv')
conn = sqlite3.connect(':memory:')
df.to_sql('enrollments', conn, index=False, if_exists='replace')

pd.read_sql("SELECT * FROM enrollments LIMIT 10;", conn)

,enrollment_id,student_name,course_name,category,level,enrollment_month,course_price,rating
0,1,Ananya,Python Basics,Programming,Beginner,Jan,1200,4.5
1,2,Rohit,Data Analysis with Excel,Analytics,Beginner,Jan,999,4.2
2,3,Mehul,SQL Foundations,Analytics,Beginner,Feb,1099,4.6
3,4,Sneha,Web Development Bootcamp,Programming,Intermediate,Feb,2499,4.4
4,5,Kunal,Machine Learning Intro,Data Science,Beginner,Mar,1999,4.3
5,6,Pooja,Power BI Essentials,Analytics,Beginner,Mar,1299,4.5
6,7,Arjun,Advanced Python,Programming,Advanced,Apr,2799,4.7
7,8,Ishita,Statistics for Data Science,Data Science,Intermediate,Apr,1599,4.4
8,9,Rahul,Digital Marketing Basics,Marketing,Beginner,May,899,4.1
9,10,Neha,UI/UX Design,Design,Beginner,May,1499,4.3

**All beginner level courses**

In [5]:
query = """
SELECT *
FROM enrollments
WHERE level = 'Beginner';
"""

pd.read_sql(query, conn)

,enrollment_id,student_name,course_name,category,level,enrollment_month,course_price,rating
0,1,Ananya,Python Basics,Programming,Beginner,Jan,1200,4.5
1,2,Rohit,Data Analysis with Excel,Analytics,Beginner,Jan,999,4.2
2,3,Mehul,SQL Foundations,Analytics,Beginner,Feb,1099,4.6
3,5,Kunal,Machine Learning Intro,Data Science,Beginner,Mar,1999,4.3
4,6,Pooja,Power BI Essentials,Analytics,Beginner,Mar,1299,4.5
5,9,Rahul,Digital Marketing Basics,Marketing,Beginner,May,899,4.1
6,10,Neha,UI/UX Design,Design,Beginner,May,1499,4.3
7,12,Simran,Cybersecurity Essentials,IT,Beginner,Jun,1699,4.5
8,14,Riya,Content Writing Masterclass,Marketing,Beginner,Jul,799,4.0
9,16,Tanvi,Business Analytics Basics,Analytics,Beginner,Aug,1199,4.3
10,18,Kavya,Graphic Design with Canva,Design,Beginner,Sep,699,4.2
11,22,Divya,Public Speaking Skills,Soft Skills,Beginner,Nov,599,4.1
12,23,Yash,Game Development Basics,Programming,Beginner,Dec,1299,4.3
13,25,Kabir,Entrepreneurship 101,Business,Beginner,Dec,999,4.2
14,27,Manav,Java Programming,Programming,Beginner,Feb,1099,4.1
15,28,Sonal,Tableau for Beginners,Analytics,Beginner,Mar,1299,4.3
16,29,Harsh,Blockchain Basics,Technology,Beginner,Apr,1799,4.2
17,30,Isha,Product Management Intro,Business,Beginner,May,1499,4.4
18,34,Payal,SEO Fundamentals,Marketing,Beginner,Sep,899,4.1
19,36,Naina,Communication Skills,Soft Skills,Beginner,Nov,499,4.0
20,38,Tanya,UX Research Basics,Design,Beginner,Dec,999,4.2

**All enrollments in category = 'Analytics'**

In [7]:
query = """
SELECT *
FROM enrollments
WHERE category = 'Analytics';
"""

pd.read_sql(query, conn)

,enrollment_id,student_name,course_name,category,level,enrollment_month,course_price,rating
0,2,Rohit,Data Analysis with Excel,Analytics,Beginner,Jan,999,4.2
1,3,Mehul,SQL Foundations,Analytics,Beginner,Feb,1099,4.6
2,6,Pooja,Power BI Essentials,Analytics,Beginner,Mar,1299,4.5
3,13,Aditya,SQL Intermediate,Analytics,Intermediate,Jul,1399,4.6
4,16,Tanvi,Business Analytics Basics,Analytics,Beginner,Aug,1199,4.3
5,24,Shalini,HR Analytics,Analytics,Intermediate,Dec,1499,4.4
6,26,Aditi,Advanced Excel,Analytics,Intermediate,Jan,1399,4.6
7,28,Sonal,Tableau for Beginners,Analytics,Beginner,Mar,1299,4.3
8,32,Rupal,Data Visualization,Analytics,Intermediate,Jul,1599,4.5
9,37,Omkar,SQL for Interviews,Analytics,Intermediate,Dec,1199,4.6

**Courses priced above 2000**

In [8]:
query = """
SELECT course_name, course_price
FROM enrollments
WHERE course_price > 2000;
"""

pd.read_sql(query, conn)

                course_name  course_price
0  Web Development Bootcamp          2499
1           Advanced Python          2799
2       Deep Learning Intro          2999
3       DevOps Fundamentals          2199
4           Ethical Hacking          2799
5       Statistics Advanced          2599

**Top 5 most expensive courses**

In [9]:
query = """
SELECT course_name, course_price
FROM enrollments
ORDER BY course_price DESC
LIMIT 5 ;
"""

pd.read_sql(query, conn)

                course_name  course_price
0       Deep Learning Intro          2999
1           Advanced Python          2799
2           Ethical Hacking          2799
3       Statistics Advanced          2599
4  Web Development Bootcamp          2499

**Lowest 5 rated courses**

In [10]:
query = """
SELECT course_name, course_price, rating
FROM enrollments
ORDER BY rating ASC
LIMIT 5 ;
"""

pd.read_sql(query, conn)

                   course_name  course_price  rating
0  Content Writing Masterclass           799     4.0
1         Communication Skills           499     4.0
2     Digital Marketing Basics           899     4.1
3       Public Speaking Skills           599     4.1
4             Java Programming          1099     4.1

**Top 3 highest rated courses**

In [11]:
query = """
SELECT course_name, course_price, rating
FROM enrollments
ORDER BY rating DESC
LIMIT 3 ;
"""

pd.read_sql(query, conn)

           course_name  course_price  rating
0      Advanced Python          2799     4.7
1  Deep Learning Intro          2999     4.7
2  Statistics Advanced          2599     4.7

**Course names containing 'SQL'**

In [12]:
query = """
SELECT course_name
FROM enrollments
WHERE course_name LIKE '%SQL%' ;
"""

pd.read_sql(query, conn)

          course_name
0     SQL Foundations
1    SQL Intermediate
2  SQL for Interviews

**Student names starting with 'A'**

In [14]:
query = """
SELECT course_name, student_name, enrollment_id
FROM enrollments
WHERE student_name LIKE 'A%' ;
"""

pd.read_sql(query, conn)

           course_name student_name  enrollment_id
0        Python Basics       Ananya              1
1      Advanced Python        Arjun              7
2     SQL Intermediate       Aditya             13
3  Deep Learning Intro         Aman             17
4       Advanced Excel        Aditi             26

**Categories IN ('Analytics','Data Science')**

In [15]:
query = """
SELECT *
FROM enrollments
WHERE category IN ('Analytics', 'Data Science') ;
"""

pd.read_sql(query, conn)

,enrollment_id,student_name,course_name,category,level,enrollment_month,course_price,rating
0,2,Rohit,Data Analysis with Excel,Analytics,Beginner,Jan,999,4.2
1,3,Mehul,SQL Foundations,Analytics,Beginner,Feb,1099,4.6
2,5,Kunal,Machine Learning Intro,Data Science,Beginner,Mar,1999,4.3
3,6,Pooja,Power BI Essentials,Analytics,Beginner,Mar,1299,4.5
4,8,Ishita,Statistics for Data Science,Data Science,Intermediate,Apr,1599,4.4
5,13,Aditya,SQL Intermediate,Analytics,Intermediate,Jul,1399,4.6
6,16,Tanvi,Business Analytics Basics,Analytics,Beginner,Aug,1199,4.3
7,17,Aman,Deep Learning Intro,Data Science,Advanced,Sep,2999,4.7
8,21,Rohan,Python for Data Analysis,Data Science,Intermediate,Nov,1599,4.6
9,24,Shalini,HR Analytics,Analytics,Intermediate,Dec,1499,4.4
10,26,Aditi,Advanced Excel,Analytics,Intermediate,Jan,1399,4.6
11,28,Sonal,Tableau for Beginners,Analytics,Beginner,Mar,1299,4.3
12,32,Rupal,Data Visualization,Analytics,Intermediate,Jul,1599,4.5
13,35,Dev,Statistics Advanced,Data Science,Advanced,Oct,2599,4.7
14,37,Omkar,SQL for Interviews,Analytics,Intermediate,Dec,1199,4.6

**Total revenue (SUM of course_price)**

In [16]:
query = """
SELECT SUM(course_price) AS Sum_of_course_price
FROM enrollments ;
"""

pd.read_sql(query, conn)

   Sum_of_course_price
0                58063

**Average course price**

In [17]:
query = """
SELECT AVG(course_price) AS Avg_of_course_price
FROM enrollments ;
"""

pd.read_sql(query, conn)

   Avg_of_course_price
0          1527.973684

**Total enrollments count**

In [18]:
query = """
SELECT COUNT(*) AS TotalEnrollments
FROM enrollments ;
"""

pd.read_sql(query, conn)

   TotalEnrollments
0                38

**Revenue per category**

In [21]:
query = """
SELECT category, SUM(course_price) AS Sum_of_course_price
FROM enrollments
GROUP BY category ;
"""

pd.read_sql(query, conn)

       category  Sum_of_course_price
0     Analytics                12990
1      Business                 2498
2  Data Science                10795
3        Design                 3197
4       Finance                 1899
5            IT                 8596
6     Marketing                 2597
7   Programming                12594
8   Soft Skills                 1098
9    Technology                 1799

**Average rating per level**

In [22]:
query = """
SELECT level, AVG(rating) AS AverageRating
FROM enrollments
GROUP BY level;
"""

pd.read_sql(query, conn)

          level  AverageRating
0      Advanced       4.675000
1      Beginner       4.257143
2  Intermediate       4.461538

**Categories where total revenue > 10000**

In [23]:
query = """
SELECT category, SUM(course_price) AS TotalRevenue
FROM enrollments
GROUP BY category
HAVING SUM(course_price) > 10000 ;
"""

pd.read_sql(query, conn)

       category  TotalRevenue
0     Analytics         12990
1  Data Science         10795
2   Programming         12594

**Levels where average price > 1500**

In [24]:
query = """
SELECT level, AVG(course_price) AS Average_price
FROM enrollments
GROUP BY level
HAVING AVG(course_price) > 1500 ;
"""

pd.read_sql(query, conn)

          level  Average_price
0      Advanced    2799.000000
1  Intermediate    1729.769231